## **Write a Pandas program to split the following dataset using group by on first column and aggregate over multiple lists on second column.**

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame([['S001', [88, 89, 90]], ['S001', [78, 81, 60]], 
                   ['S002', [84, 83, 91]], ['S002', [84, 88, 91]], 
                   ['S003', [90, 89, 92]], ['S003', [88, 59, 90]]], 
                  columns= ['student_id', 'marks'])
df

  student_id         marks
0       S001  [88, 89, 90]
1       S001  [78, 81, 60]
2       S002  [84, 83, 91]
3       S002  [84, 88, 91]
4       S003  [90, 89, 92]
5       S003  [88, 59, 90]

In [ ]:
df1 = df.set_index('student_id')['marks'].groupby('student_id')
df1.apply(list).apply(lambda x: np.mean(x,0))

student_id
S001    [83.0, 85.0, 75.0]
S002    [84.0, 85.5, 91.0]
S003    [89.0, 74.0, 91.0]
Name: marks, dtype: object

##**Write a Pandas program to replace the missing values with the most frequent values present in each column of a given dataframe.**

In [ ]:
df = pd.DataFrame({'name':['Jay','Jhanvi','Prachi','Prapti','Harsh','Nomika'], 
                   'Age':[12, 15, 20, np.NaN, 15, 15], 
                   'sex':['M','F','F','F','M','F']})

In [ ]:
df

     name   Age sex
0     Jay  12.0   M
1  Jhanvi  15.0   F
2  Prachi  20.0   F
3  Prapti   NaN   F
4   Harsh  15.0   M
5  Nomika  15.0   F

In [ ]:
df = df.fillna(df.mode().iloc[0])
df

     name   Age sex
0     Jay  12.0   M
1  Jhanvi  15.0   F
2  Prachi  20.0   F
3  Prapti  15.0   F
4   Harsh  15.0   M
5  Nomika  15.0   F

##**Write a Pandas program to drop those rows from a given DataFrame in which specific columns have missing values.**

In [ ]:
df = pd.DataFrame({'name':['Jay','Arya','Rachi','Diya','Yash','Tanvi','Nomika'], 
                   'Age':[12, 15, 20, np.NaN, 15, np.NaN, 15], 
                   'sex':['M','F','F','F','M','F', 'F']})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   Age     5 non-null      float64
 2   sex     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [ ]:
df[df['Age'].isnull()]

    name  Age sex
3   Diya  NaN   F
5  Tanvi  NaN   F

In [ ]:
df = df.dropna(axis=0)
df

     name   Age sex
0     Jay  12.0   M
1    Arya  15.0   F
2   Rachi  20.0   F
4    Yash  15.0   M
6  Nomika  15.0   F

##**Read the data: https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv and perform the following :**

In [ ]:
df=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv')

In [ ]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

### a) Write a Pandas program to find the diamonds that are with a Fair or Good or Premium.

In [ ]:
df.query(' cut=="Good" or cut=="Fair" or cut=="Premium" ')

       carat      cut color clarity  depth  table  price     x     y     z
1       0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
8       0.22     Fair     E     VS2   65.1   61.0    337  3.87  3.78  2.49
...      ...      ...   ...     ...    ...    ...    ...   ...   ...   ...
53930   0.71  Premium     E     SI1   60.5   55.0   2756  5.79  5.74  3.49
53931   0.71  Premium     F     SI1   59.8   62.0   2756  5.74  5.73  3.43
53934   0.72  Premium     D     SI1   62.7   59.0   2757  5.69  5.73  3.58
53936   0.72     Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53938   0.86  Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74

[20307 rows x 10 columns]

### b) Write a Pandas program to get the true memory usage by diamonds DataFrame.

In [ ]:
print('Total memory usage by diamonds Dataframe:',df.memory_usage(index = True).sum())

Total memory usage by diamonds Dataframe: 4315328

### c) Write a Pandas program to count the duplicate rows of diamonds DataFrame.

In [ ]:
print('Total duplicated rows:',len(df[df.duplicated()].index))

Total duplicated rows: 146

### d) Write a Pandas program to read rows 2 through 5 (inclusive), columns in positions 0 through 2 (exclusive) of diamonds DataFrame.

In [ ]:
df.iloc[2:6, 0:2]

   carat        cut
2   0.23       Good
3   0.29    Premium
4   0.31       Good
5   0.24  Very Good